<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"4e9f81cd8f16da3008843c865348b9619a5d3ef66d3354d116c7ac9e6d49bba6","plan_job_ref":"Job Create terraform plan #37 at https://github.com/coforma/co-boomi-atom-fargate/actions/runs/7147085013","plan_hash":"0610a7d48a89d788e5ce17804c8f93b37fe94743e4e3f74760da7d31c14d975a","plan_text_format":"text","version":"1.38.0"} -->
Terraform plan in __.__
<details>
<summary>Plan: 3 to add, 1 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/247529c6ab72687cf0aabc72c1a0e418409493e96adf99c0a2793a77b36d0e7e.zip" -> "builds/7b91b3dbfbd3a3bba012d2c1d982809766b9bf6a2a4fd5d4a51a2e46deb4133e.zip"
        id                             = "co-boomi-atom-secret-install-lambda"
      ~ last_modified                  = "2023-12-01T23:39:16.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:23" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:23/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "23" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_permission.current_version_triggers["secrets"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "*******" -> (known after apply)
      ~ qualifier           = "23" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./lambda/rotate_install_token.py",
                      + null,
                    ],
                  + [
                      + "zip",
                      + "./lambda/package/",
                      + null,
                    ],
                ]
              + filename      = "builds/7b91b3dbfbd3a3bba012d2c1d982809766b9bf6a2a4fd5d4a51a2e46deb4133e.zip"
              + runtime       = "python3.11"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7b91b3dbfbd3a3bba012d2c1d982809766b9bf6a2a4fd5d4a51a2e46deb4133e.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "*******************" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/247529c6ab72687cf0aabc72c1a0e418409493e96adf99c0a2793a77b36d0e7e.zip" -> "builds/7b91b3dbfbd3a3bba012d2c1d982809766b9bf6a2a4fd5d4a51a2e46deb4133e.zip"
          ~ "timestamp" = "1701473945667739000" -> "1702075844778709000"
        }
    }

Plan: 3 to add, 1 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #37](https://github.com/coforma/co-boomi-atom-fargate/actions/runs/7147085013)